Revit 2027 API
ParameterTypeId.SketchingJoinStatus Property
 "Join Status"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SketchingJoinStatus { get; }
Public Shared ReadOnly Property SketchingJoinStatus As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SketchingJoinStatus {
	ForgeTypeId^ get ();
}
static member SketchingJoinStatus : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace